In [53]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [28]:
%sql mysql+pymysql://root:Guruji_0134@127.0.0.1:3306/md_water_services

'Connected: root@md_water_services'

# Clustering data to unveil Maji Ndogo's water crisis

# Cleaning Data
 We need to send reports to the employees yet we don't have their emails. 
 There is need to update the details

# What to do
 Use SELECT to select employees table,Replace the space with a fullstop,Make it lowercase and stitch them together

In [29]:
%%sql
SELECT 
    REPLACE(employee_name,' ','.')
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('Amara.Jengo',),
 ('Bello.Azibo',),
 ('Bakari.Iniko',),
 ('Malachi.Mavuso',),
 ('Cheche.Buhle',)]

# LOWER CASE

In [30]:
%%sql
SELECT
    LOWER(REPLACE(employee_name,' ','.'))
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('amara.jengo',),
 ('bello.azibo',),
 ('bakari.iniko',),
 ('malachi.mavuso',),
 ('cheche.buhle',)]

# Using concatanate to have emails for all employees

In [31]:
%%sql
SELECT
    CONCAT(
        LOWER(REPLACE(employee_name,' ','.')),'@ndogowater.gov') as New_email
FROM 
    employee
LIMIT 5;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('amara.jengo@ndogowater.gov',),
 ('bello.azibo@ndogowater.gov',),
 ('bakari.iniko@ndogowater.gov',),
 ('malachi.mavuso@ndogowater.gov',),
 ('cheche.buhle@ndogowater.gov',)]

# Updating the details

In [32]:
%%sql
UPDATE
    employee
SET email= CONCAT(
        LOWER(REPLACE(employee_name,' ','.')),'@ndogowater.gov')

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
56 rows affected.

ResourceClosedError: This result object does not return rows. It has been closed automatically.

# Phone number error;has an extra character a white space at the end

In [33]:
%%sql 
SELECT
    LENGTH(phone_number)
FROM 
    employee
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[(12,), (12,), (12,)]

In [34]:
# Will use TRIM () to remove any leading or trailing space from the string

In [35]:
%%sql 
SELECT
    TRIM(phone_number)
FROM 
    employee
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[('+99637993287',), ('+99643864786',), ('+99222599041',)]

In [36]:
%%sql
UPDATE
    employee
SET phone_number =TRIM(phone_number);

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
56 rows affected.

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [ ]:
%%sql 
SELECT
    LENGTH(phone_number)
FROM 
    employee
LIMIT 3;

# Employee Distribution
Determining the number of employees living in each town

In [37]:
%%sql
SELECT 
	town_name,
    COUNT(employee_name) AS Num_employee
 FROM md_water_services.employee
 GROUP BY town_name;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
9 rows affected.

[('Ilanga', 3),
 ('Rural', 29),
 ('Lusaka', 4),
 ('Zanzibar', 4),
 ('Dahabu', 6),
 ('Kintampo', 1),
 ('Harare', 5),
 ('Yaounde', 1),
 ('Serowe', 3)]

# Congraculating employees with best performance
First find the employees with higher perfomance

In [38]:
%%sql
SELECT 
    assigned_employee_id,
    COUNT(*) AS number_of_visits
FROM md_water_services.visits
GROUP BY assigned_employee_id
ORDER BY number_of_visits DESC
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[(1, 3708), (30, 3676), (34, 3539)]

# Finding who are they and their contact details

In [39]:
%%sql
SELECT 
    e.employee_name,
    e.phone_number,
    e.email,
    COUNT(*) AS number_of_visits
FROM md_water_services.visits v
JOIN md_water_services.employee e 
    ON v.assigned_employee_id = e.assigned_employee_id
GROUP BY e.employee_name, e.phone_number, e.email
ORDER BY number_of_visits DESC
LIMIT 3;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
3 rows affected.

[('Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', 3708),
 ('Pili Zola', '+99822478933', 'pili.zola@ndogowater.gov', 3676),
 ('Rudo Imani', '+99046972648', 'rudo.imani@ndogowater.gov', 3539)]

# Analysing locations

# Create a query that counts the number of records per town

In [40]:
%%sql
SELECT
    COUNT(town_name) AS records_per_town,
    town_name
FROM md_water_services.location
GROUP BY town_name
ORDER BY records_per_town DESC, town_name ASC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
10 rows affected.

[(23740, 'Rural'),
 (1650, 'Harare'),
 (1090, 'Amina'),
 (1070, 'Lusaka'),
 (990, 'Mrembo'),
 (930, 'Asmara'),
 (930, 'Dahabu'),
 (780, 'Ilanga'),
 (780, 'Kintampo'),
 (770, 'Isiqalo')]

# Now count the records per province.

In [41]:
%%sql
SELECT
    COUNT(province_name) AS records_per_province,
    province_name
FROM md_water_services.location
GROUP BY province_name
ORDER BY records_per_province DESC, province_name ASC;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[(9510, 'Kilimani'),
 (8940, 'Akatsi'),
 (8220, 'Sokoto'),
 (6950, 'Amanzi'),
 (6030, 'Hawassa')]

# Create a result set showing:
• province_name
• town_name
• An aggregated count of records for each town (consider naming this records_per_town).
• Ensure your data is grouped by both province_name and town_name.
Order your results primarily by province_name. Within each province, further sort the towns by their record counts in descending order.

In [42]:
%%sql
SELECT
	province_name,
    town_name,
    COUNT(town_name) AS records_per_town
FROM md_water_services.location
GROUP BY province_name,town_name
ORDER BY province_name, records_per_town DESC
LIMIT 8;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
8 rows affected.

[('Akatsi', 'Rural', 6290),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Amanzi', 'Rural', 3100),
 ('Amanzi', 'Asmara', 930),
 ('Amanzi', 'Dahabu', 930),
 ('Amanzi', 'Amina', 670)]

# Number of records per location type

In [43]:
%%sql
SELECT
COUNT(province_name) AS num_of_sources,
location_type
FROM md_water_services.location
GROUP BY location_type
ORDER BY num_of_sources;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
2 rows affected.

[(15910, 'Urban'), (23740, 'Rural')]

# How many people were surveyed?

In [44]:
%%sql
SELECT 
SUM(number_of_people_served) AS Total_people_surveyed
FROM md_water_services.water_source;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

In [45]:
%%sql
SELECT 
type_of_water_source,
COUNT(type_of_water_source) AS num_of_source
FROM md_water_services.water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

# Average number of people that are served by each water source?

In [46]:
%%sql
SELECT 
type_of_water_source,
ROUND(avg(number_of_people_served),0) AS AVG_number_per_source
FROM md_water_services.water_source
GROUP BY type_of_water_source;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644')),
 ('tap_in_home_broken', Decimal('649')),
 ('well', Decimal('279')),
 ('shared_tap', Decimal('2071')),
 ('river', Decimal('699'))]

# Calculating the total number of people served by each type of water source in total

In [47]:
%%sql
SELECT 
	type_of_water_source,
	SUM(number_of_people_served) AS Total_people_surveyed 
 FROM md_water_services.water_source 
 GROUP BY type_of_water_source
 ORDER BY Total_people_surveyed DESC;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

# Percentage of people served

In [48]:
%%sql
SELECT 
    type_of_water_source,
    ROUND(
        (SUM(number_of_people_served) * 100.0) / 
        (SELECT SUM(number_of_people_served) FROM md_water_services.water_source),
        0
    ) AS percentage_people_served
FROM md_water_services.water_source
GROUP BY type_of_water_source
ORDER BY percentage_people_served DESC;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('43')),
 ('well', Decimal('18')),
 ('tap_in_home', Decimal('17')),
 ('tap_in_home_broken', Decimal('14')),
 ('river', Decimal('9'))]

# Determining which source should be given priority of being repaired
Using window function RANK()

In [49]:
%%sql 
SELECT 
    type_of_water_source,
    SUM(number_of_people_served) AS people_served,
    RANK() OVER (ORDER BY SUM(number_of_people_served) DESC) AS rank_by_population
FROM md_water_services.water_source
GROUP BY type_of_water_source
ORDER BY rank_by_population;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

# Which shared taps or wells should be fixed first? 
We can use the same logic; the most used sources should really be fixed first.

In [50]:
%%sql
SELECT 
    source_id,
    type_of_water_source,
    number_of_people_served,
    RANK() OVER (
        PARTITION BY type_of_water_source 
        ORDER BY number_of_people_served DESC
    ) AS Priority_Rank
FROM md_water_services.water_source
WHERE type_of_water_source != 'river' 
ORDER BY type_of_water_source, Priority_Rank ASC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
10 rows affected.

[('HaRu19509224', 'shared_tap', 3998, 1),
 ('AkRu05603224', 'shared_tap', 3998, 1),
 ('AkRu04862224', 'shared_tap', 3996, 3),
 ('AmAs10911224', 'shared_tap', 3996, 3),
 ('KiHa22867224', 'shared_tap', 3996, 3),
 ('KiZu31330224', 'shared_tap', 3994, 6),
 ('HaRu19839224', 'shared_tap', 3994, 6),
 ('KiRu28630224', 'shared_tap', 3992, 8),
 ('KiZu31415224', 'shared_tap', 3992, 8),
 ('KiRu26218224', 'shared_tap', 3990, 10)]

# Easing the engineer's work by using ROW_NUMBER() window function

In [51]:
%%sql
SELECT 
    source_id,
    type_of_water_source,
    number_of_people_served,
    ROW_NUMBER() OVER (
        PARTITION BY type_of_water_source 
        ORDER BY number_of_people_served DESC, 
                 source_id ASC  -- Tie-breaker: ensures consistent, unique ordering
    ) AS Priority_Rank
FROM md_water_services.water_source
WHERE type_of_water_source != 'river'
ORDER BY type_of_water_source, Priority_Rank ASC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
10 rows affected.

[('AkRu05603224', 'shared_tap', 3998, 1),
 ('HaRu19509224', 'shared_tap', 3998, 2),
 ('AkRu04862224', 'shared_tap', 3996, 3),
 ('AmAs10911224', 'shared_tap', 3996, 4),
 ('KiHa22867224', 'shared_tap', 3996, 5),
 ('HaRu19839224', 'shared_tap', 3994, 6),
 ('KiZu31330224', 'shared_tap', 3994, 7),
 ('KiRu28630224', 'shared_tap', 3992, 8),
 ('KiZu31415224', 'shared_tap', 3992, 9),
 ('AmPw12653224', 'shared_tap', 3990, 10)]

# Analysing queues in our dataset to gain insight of water scarcity well

In [52]:
%%sql
SELECT 
    MIN(time_of_record) AS first_survey_date,
    MAX(time_of_record) AS last_survey_date,
    DATEDIFF(MAX(time_of_record), MIN(time_of_record)) AS survey_duration_days
FROM md_water_services.visits;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
1 rows affected.

[(datetime.datetime(2021, 1, 1, 9, 10), datetime.datetime(2023, 7, 14, 13, 53), 924)]

# Average time people queue for water in Maji_Ndogo

In [54]:
%%sql
SELECT 
    ROUND(AVG(NULLIF(time_in_queue, 0)),0) AS avg_queue_time
FROM md_water_services.visits;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
1 rows affected.

[(Decimal('123'),)]

# Aggregate of time of queue across different days of the week

In [56]:
%%sql
SELECT 
    DAYNAME(time_of_record) AS day_of_week,
    ROUND(AVG(NULLIF(time_in_queue, 0)),0) AS avg_queue_time
FROM md_water_services.visits
GROUP BY DAYNAME(time_of_record)
ORDER BY FIELD(day_of_week, 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday');

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
7 rows affected.

[('Monday', Decimal('137')),
 ('Tuesday', Decimal('108')),
 ('Wednesday', Decimal('97')),
 ('Thursday', Decimal('105')),
 ('Friday', Decimal('120')),
 ('Saturday', Decimal('246')),
 ('Sunday', Decimal('82'))]

# Time of the day people fetch water

In [58]:
%%sql
SELECT 
    HOUR(time_of_record) AS hour_of_day,
    ROUND(AVG(NULLIF(time_in_queue, 0)),0) AS avg_queue_time
FROM md_water_services.visits
GROUP BY HOUR(time_of_record)
ORDER BY hour_of_day
LIMIT 6;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
6 rows affected.

[(6, Decimal('149')),
 (7, Decimal('149')),
 (8, Decimal('149')),
 (9, Decimal('118')),
 (10, Decimal('114')),
 (11, Decimal('111'))]

#By averaging a CASE expression that flags only Sunday visits (with 0s for other days), we isolate Sunday’s average queue time — then group and order by hour_of_day to show hourly trends chronologically, rounded to 0 decimals.

In [61]:
%%sql
SELECT
TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
-- Sunday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
ELSE NULL
END
),0) AS Sunday,
-- Monday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
ELSE NULL
END
),0) AS Monday,
-- Tuesday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
ELSE NULL
END
),0) AS Tuesday,
-- Wednesday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
ELSE NULL
END
),0) AS Wednesday,
-- Thursday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
ELSE NULL
END
),0) AS Thursday,
-- Friday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
ELSE NULL
END
),0) AS Friday,
-- Saturday
ROUND(AVG(
CASE
WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
ELSE NULL
END
),0) AS Saturday
FROM
visits
WHERE
time_in_queue != 0 -- this excludes other sources with 0 queue times
GROUP BY
hour_of_day
ORDER BY
hour_of_day;

 * mysql+pymysql://root:***@127.0.0.1:3306/md_water_services
14 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('95'), Decimal('112'), Decimal('259')),
 ('11:00', Decimal('78'), Decimal('115'), Decimal('102'), Decimal('86'), Decimal('99'), Decimal('104'), Decimal('236')),
 ('12:00', Decimal('78'), Decimal('115'), Decimal('97'), Decimal('88'), Decimal('96'), Decimal('109'), Decimal('239')),
 ('13:00', Decimal('81'), Decimal('122'), Decimal('97'), Decimal('98'), Decimal('101'), Decimal('115'), Decimal('242')),
 ('14:00', Decimal('83'), Decimal('127'), Decimal('104'), Decimal('92'), Decimal('96'), Decimal('110'), Decimal('244')),
 ('15:00', Decimal('83'), Decimal('126'), Decimal('104'), Decimal('88'), Decimal('92'), Decimal('110'), Decimal('248')),
 ('16:00', Decimal('83'), Decimal('127'), Decimal('99'), Decimal('90'), Decimal('99'), Decimal('109'), Decimal('251')),
 ('17:00', Decimal('79'), Decimal('181'), Decimal('135'), Decimal('121'), Decimal('129'), Decimal('151'), Decimal('251')),
 ('18:00', Decimal('80'), Decimal('174'), Decimal('122'), Decimal('113'), Decimal('132'), Decimal('158'), Decimal('240')),
 ('19:00', Decimal('127'), Decimal('159'), Decimal('145'), Decimal('176'), Decimal('137'), Decimal('103'), Decimal('282'))]

Now we can compare the queue times for each day, hour by hour!
1. Queues are very long on a Monday morning and Monday evening as people rush to get water.
2. Wednesday has the lowest queue times, but long queues on Wednesday evening.
3. People have to queue pretty much twice as long on Saturdays compared to the weekdays. It looks like people spend their Saturdays queueing
for water, perhaps for the week's supply?
4. The shortest queues are on Sundays, and this is a cultural thing. The people of Maji Ndogo prioritise family and religion, so Sundays are spent
with family and friends.